#+TITLE: Emacs Configuration
#+AUTHOR: Ahsanur Rahman
#+STARTUP: overview
#+PROPERTY: header-args:emacs-lisp :tangle config.el :mkdirp yes

** Core Backend: AUCTeX and Tectonic
This configures the foundational packages. *AUCTeX* is the primary editing environment, enhanced with *Tectonic* as the default compiler for its modern, all-in-one approach.
#+begin_src emacs-lisp
(use-package tex
  :ensure auctex
  :defer t
  :config
  ;; Set the default TeX engine to Tectonic.
  (setq TeX-engine 'tectonic)
  (add-to-list 'TeX-engine-alist
               '(tectonic "Tectonic" "tectonic -X compile %s -o %o" "tectonic -X compile %s -o %o" "tectonic -X compile %s -o %o"))

  ;; Add compilation and syntax checking commands
  (setq TeX-command-list
        (append TeX-command-list
                '(("Tectonic" "tectonic -X compile %s" TeX-run-command nil
                   (latex-mode) :help "Compile with Tectonic")
                  ("Tectonic Watch" "tectonic -X watch %s" TeX-run-command nil
                   (latex-mode) :help "Continuously compile with Tectonic")
                  ("ChkTeX" "chktex -v0 -q -I %s" TeX-run-compile nil
                   (latex-mode) :help "Check with ChkTeX")
                  ("Check" "lacheck %s" TeX-run-compile nil
                   (latex-mode) :help "Check with lacheck"))))

  ;; Use PDF-Tools as the default viewer and enable source correlation (SyncTeX).
  (setq TeX-view-program-selection '((output-pdf "PDF Tools")))
  (setq TeX-source-correlate-mode t)
  (setq TeX-PDF-mode t)

  ;; Enable folding of macros and environments, which is built into AUCTeX.
  (add-hook 'latex-mode-hook #'tex-fold-mode)
  (setq tex-newline-function 'newline-and-indent)

  ;; indentation settings
  (setq latex-indent-level 2
        latex-item-indent 0
        tex-brace-indent-level 2))

;; Custom keybindings for syntax checking
(with-eval-after-load 'latex
  (define-key LaTeX-mode-map (kbd "C-c C-k")
              (lambda ()
                (interactive)
                (TeX-command "ChkTeX" 'TeX-master-file)))

  (define-key LaTeX-mode-map (kbd "C-c C-l")
              (lambda ()
                (interactive)
                (TeX-command "Check" 'TeX-master-file))))

;; Provides evil-mode integration for AUCTeX environments.
(use-package evil-tex
  :ensure t
  :after (tex evil)
  :defer t)
#+end_src

#+RESULTS:
: Ignoring ’:ensure t’ in ’evil-tex’ config

